addi $sp, $sp, -20 #δημιουργώ 5 θέσεις στη στοίβα
sw $ra, 0($sp) #αποθηκεύω την τιμή του $ra στη στοίβα, ώστε να μπορώ να επιστρέψω αργότερα στη συνάρτηση που κάλεσε την EXPONENTIAL
sw $s0, 4($sp) #θέλω να χρησιμοποιήσω στη συνάρτησή μου τον καταχωρητή $s0 όμως δε γνωρίζω εάν και πως χρησιμοποιείται στο κύριο πρόγραμμα οπότε αποθηκεύω το περιεχόμενό του στη στοίβα
addi $s0, $s0, 1 #bound=1
sw $s1, 8($sp) #ομοίως με πάνω
sw $s2, 12($sp) #ομοίως με πάνω
sw $s3, 16($sp) #ομοίως με πάνω
sll $s1, $s0, 2 #το περιεχόμενο του $s1 ισούται με 4bound
add $t6, $a0, $s1 #καταχωρώ στον $t6 τη διεύθυνση του Α[bound]
sll $s2, $a1, 2 # το περιεχόμενο του $s2 ισούται με 4N
slt $t0, $s0, $a1 #αν bound<N t0=1
lw $s3, 0($t6) #φορτώνω στον $s3 την τιμή που βρίσκεται στη διεύθυνση bound του πίνακα Α
slt $t1, $s3, $a2 #αν Α[bound]<key το περιεχόμενο του $t1 ισούται με τη μονάδα
and $t2, $t1, $t0 #αν $t0=$t1 τότε $t2=1
addi $t3, $zero, 1 #το περιεχόμενο του $t3 ισούται με 1
beq $t2, $t3, LOOP #αν το περιεχόμενο του $t2 είναι 1 μπαίνω στο LOOP
LOOP: sll $s0, $s0, 1 #bound=2bound
sll $s1, $s1, 1 #Διπλασιάζω το περιεχόμενο του
$s1
lw $s3, 0($t6) #φορτώνω στον $s3 την τιμή που βρίσκεται στη διεύθυνση bound του πίνακα Α
slt $t0, $s0, $a1 #Αν το περιεχόμενο του $s0 ισούται με αυτό του $a1 τότε $t0=1
beq $t0, $zero, HI #αν το $t0 δεν είναι μηδενικό παω στο ΗΙ
slt $t1, $s3, $a2 #αν Α[bound]<key $t1=1
and $t2, $t1, $t0 #αν t1=t0=1, t2=1
beq $t2, $t3, LOOP #αν το περιεχόμενο του $t2 ισούται με 1 πήγαινε ξανά στο
LOOP
HI: addi $t4, $a1, -1 #t4=N-1
slt $t5, $s0, $t4 #t5=1 αν bound<N-1
beq $t5, $t3, EXIT5 #Αν t5=1 πηγαίνω στο EXIT5
bne $t5, $t3, EXIT6 #Αν t5!=1 πηγαίνω στο EXIT6
EXIT5: srl $a1, $s0, 1 #a1=bound/2
addi $a3, $a2, 0 #a3=key
addi $a2, $s0, 0 #a2=bound
jal binary_search_rec #πηγαίνω στη binary_search_rec
με τα νέα ορίσματα
j EXIT #πηγαίνω στο ΕΧΙΤ
EXIT6:addi $a3, $a2, 0 #a3=key
addi $a2, $a1, -1 #a2=N-1
srl $a1, $s0, 1 #a1=bound/2
jal binary_search_rec #πηγαίνω στη binary_search_rec με τα νέα ορίσματα
EXIT: lw $s3, 16($sp) #επαναφέρω την αρχική τιμή του καταχωρητή $s3
lw $s2, 12($sp) #ομοίως
lw $s1, 8($sp) #ομοίως
lw $s0, 4($sp)#ομοίως
lw $ra, 0($sp)#επαναφέρω την αρχική
διεύθυνση επιστροφής στον $ra
addi $sp, $sp, 20#διαγράφω 5 στοιχεία από τη
στοίβα
jr $ra#επιστρέφω στη συνάρτηση που
με κάλεσε
